In [29]:
import duckdb
import pandas as pd
import os
from datetime import datetime

In [30]:
con = duckdb.connect(database='dados_duckdb.db', read_only=False)

In [31]:
arquivo = 'z0019_2.csv'
data_ingestao = datetime.now()
df = pd.read_csv(f'../landing/{arquivo}', sep=';')
df['nome_arquivo'] = arquivo
df['data_ingestao'] = data_ingestao
df.head()

   NATBR    MAKTX WERKS  MAINS  LABST nome_arquivo              data_ingestao
0  10004    SERRA  BT10    100    200  z0019_2.csv 2025-04-24 00:52:29.385232
1  10005  MACHADO  BT50    100    100  z0019_2.csv 2025-04-24 00:52:29.385232
2  10006    PREGO  BT10    100     60  z0019_2.csv 2025-04-24 00:52:29.385232

In [32]:
con.execute("""
            CREATE TABLE IF NOT EXISTS bronze_produtos (
                
            NATBR VARCHAR,
            MAKTX VARCHAR,
            WERKS VARCHAR,
            MAINS VARCHAR,
            LABST VARCHAR,
            nome_arquivo VARCHAR,
            data_ingestao TIMESTAMP
            )
            
            """)

In [33]:
con.execute("INSERT INTO bronze_produtos SELECT * FROM df")

In [34]:
resultado = con.execute("SELECT * FROM bronze_produtos").fetchdf()
resultado.head()

   NATBR    MAKTX WERKS MAINS LABST nome_arquivo              data_ingestao
0  10004    SERRA  BT10   100   200  z0019_2.csv 2025-04-24 00:52:29.385232
1  10005  MACHADO  BT50   100   100  z0019_2.csv 2025-04-24 00:52:29.385232
2  10006    PREGO  BT10   100    60  z0019_2.csv 2025-04-24 00:52:29.385232

In [35]:
con.execute("ALTER TABLE bronze_produtos RENAME TO bronze_z0019")

CatalogException: Catalog Error: Could not rename "bronze_produtos" to "bronze_z0019": another entry with this name already exists!

In [36]:
resultado = con.execute("SELECT * FROM bronze_z0019").fetchdf()
resultado.head()

   NATBR     MAKTX WERKS MAINS LABST nome_arquivo              data_ingestao
0  10001  PARAFUSO  BT10   100   100  z0019_1.csv 2025-04-23 00:38:21.662931
1  10002   MARTELO  BT50   100  1500  z0019_1.csv 2025-04-23 00:38:21.662931
2  10003     PREGO  BT10   100    50  z0019_1.csv 2025-04-23 00:38:21.662931
3  10004     SERRA  BT10   100   200  z0019_2.csv 2025-04-23 00:50:09.909126
4  10005   MACHADO  BT50   100   100  z0019_2.csv 2025-04-23 00:50:09.909126

In [28]:
con.close()